#=============================================================================
# [ 방법 1 ]

# [0] 변수 선언부
T    = int(input())
list = []


# [1] 테스트 케이스(T)에 따라 값 입력 후 조정
for i in range(T):
    Test = input()
    
    if len(Test.split()) == 1:
        pass
    else:
        R, S = Test.split()
        R    = int(R)
        
        for i in S:
            for _ in range(R):
                list.append(i)


# [2] 출력
    if (len(list) == 0):
        pass
    else:
        P = ("".join(list)).strip()
        list = []
        
        print(P)
#=============================================================================
        
    
#=============================================================================
# [ 방법 2 ]

# [1] 테스트 케이스(T) 입력 
T = int(input())

# [2] 출력
for _ in range(T):
    R, S = input().split()

    for i in S:
        print(i*int(R), end="")

    print()
#=============================================================================
