# [방법 1] -------------------------------------------------------------------------------------------

# [0] 변수 선언부 
S     = input()
list  = []
false = []

# [1] 출력 
for i in range(ord('a'), ord('z')+1):
    for j in range(len(S)):
        if(S[j] == chr(i)):    
            list.append(j)
            # [예외 처리] : 같은 문자 있을때 리스트에 해당 인덱스를 연속으로 삽입하는 것을 방지 
            break    
        
        else:
            false.append(-1)
            
    # -1이 문자열의 길이만큼 있을 경우, -1을 한 번 삽입       
    if(len(S) == len(false)):
        list.append(-1)
        false = []
    else:
        false = []

# int형 리스트를 문자열로 변환하면 오류발생 -> mapping 작업 필요
print(' '.join(map(str,list))) 

# ----------------------------------------------------------------------------------------------------


# [방법 2] -------------------------------------------------------------------------------------------

# [0] 변수 선언부 
S    = input()
list  = []

# [1] 출력 
for i in range(ord('a'), ord('z')+1):
    # 해당 알파벳이 없을 경우 -1 반환
    if(S.find(chr(i)) == -1):
        list.append(-1)
    else:
        A = S.find(chr(i))
        list.append(A)
 
 # int형 리스트를 문자열로 변환하면 오류발생 -> mapping 작업 필요
 print(' '.join(map(str,list)))
 
# ----------------------------------------------------------------------------------------------------
