# ======================================================================================================================================
# 실패 코드 
# 실패 이유 : word_1에 iia가 있고, word_2에 iaa가 있을 경우 find 함수는 word_1에서 i 1개와 a 1개 밖에 찾지를 못함.


# [0] 변수 선언부
T = int(input())


# [1] 애너그램 확인 후 출력 
for i in range(T):
    word_1, word_2 = map(str, input().split())

    for j in word_1:
        if( word_2.find(j) == -1 ):
           Judgment = "false"
        else:
           Judgment = "true"

    if(Judgment == "true"):
        print(word_1 + " & " + word_2, "are anagrams.")
    else:
        print(word_1 + " & " + word_2, "are NOT anagrams.")
# ======================================================================================================================================



# ======================================================================================================================================
# 참고 및 성공 코드 


# [0] 변수 선언부 
T = int(input())


# [1] 애너그램 확인 후 출력 
for i in range(T):
    word_1, word_2 = map(str, input().split())
    w1 = list(word_1)
    w2 = list(word_2)
    
    if(sorted(w1) == sorted(w2)):
        print(word_1 + " & " + word_2, "are anagrams.")
        
    else:
        print(word_1 + " & " + word_2, "are NOT anagrams.")
# ======================================================================================================================================
